src/Documents/ЭлектронноеПисьмоВходящее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЭлектронноеПисьмоВходящее</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийЗаголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНаСервере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторыОснований</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправительАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправительКонтакт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтработатьПосле</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправительПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рассмотрено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокПолучателейКопий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокПолучателейПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПолучателиПисьма</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиКопий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиОтвета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Лаборатория</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховаяКомпания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Клиенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорпоративныеКонтрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосОрган</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВидыВзаимодействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыВзаимодействий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидВзаимодействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексКартинки</Name>
					<Comment>Индекс иконки, соответствующей взаимодействию, для показа в списке</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/ЭлектронноеПисьмоВходящее/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработкиСтоматология.ПриСозданииНаСервере(ЭтаФорма);
	
	СформироватьОписаниеПисьма();
	
	ЗадатьВидимостьЭлементов();
	
	ОпределитьОтправителяПисьма(); 
	
	СтруктураМеню = Новый Структура;
	СтруктураМеню.Вставить("Письмо"  , "ГруппаОсновные");
	СтруктураМеню.Вставить("Свойства", "ГруппаСвойства");	
	
	ОбработкаТабличныхЧастейКлиент.СоздатьМенюДокумента(ЭтаФорма, СтруктураМеню, "ГруппаПереключательЗакладок");
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события формы "ПослеЗаписи"
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзмененоЭлектронноеПисьмо", Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОткрытьВложениеВыполнить()
	
	УправлениеЭлектроннойПочтойКлиент.ОткрытьВложение(Элементы.Вложения.ТекущиеДанные.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура СохранитьВложениеВыполнить()
	
	УправлениеЭлектроннойПочтойКлиент.СохранитьВложение(Элементы.Вложения.ТекущиеДанные.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура ДополнительноВыполнить()
	
	Текст = Новый ТекстовыйДокумент;
	Текст.ДобавитьСтроку(ДополнительнаяИнформацияОПисьме);
	Текст.ДобавитьСтроку("");
	Текст.ДобавитьСтроку("");
	Текст.ДобавитьСтроку("-------------------------------------------------");
	Текст.ДобавитьСтроку(Объект.ВнутреннийЗаголовок);
	Текст.Показать();

КонецПроцедуры

&НаКлиенте
Процедура Ответить(Команда)
	
	Если НЕ ПроверитьНаВозможностьОтпавкиПисьма(Объект.УчетнаяЗапись) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Учетная запись не предназначена для отправки писем");
		Возврат;
	КонецЕсли;
	
	Основание = Новый Структура("Предмет, Команда", Объект.Ссылка, "Ответить");
	ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения", Основание);
	ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.ФормаДокумента", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветитьВсем(Команда)
	
	Если НЕ ПроверитьНаВозможностьОтпавкиПисьма(Объект.УчетнаяЗапись) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Учетная запись не предназначена для отправки писем");
		Возврат;
	КонецЕсли;
	
	Основание = Новый Структура("Предмет, Команда", Объект.Ссылка, "ОтветитьВсем");
	ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения", Основание);
	ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.ФормаДокумента", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура Переслать(Команда)
	
	Если НЕ ПроверитьНаВозможностьОтпавкиПисьма(Объект.УчетнаяЗапись) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Учетная запись не предназначена для отправки писем");
		Возврат;
	КонецЕсли;
	
	Основание = Новый Структура("Предмет, Команда", Объект.Ссылка, "Переслать");
	ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения, ПереноситьВложения", Основание, Истина);
	ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.ФормаДокумента", ПараметрыОткрытия);
	
КонецПроцедуры

 #КонецОбласти
 
#Область ОбработчикиСобытийЭлементовШапкиФормы 

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
// Процедура, выполняет обработку нажатия динамических кнопок.
//
Процедура ПроцедураОбработкиНажатияМеню(Элемент)
	
	ОбработкаТабличныхЧастейКлиент.ПроцедураОбработкиНажатияМеню(ЭтаФорма, Элемент.Имя);	
		
КонецПроцедуры

&НаКлиенте
Процедура ВложенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	УправлениеЭлектроннойПочтойКлиент.ОткрытьВложение(Элементы.Вложения.ТекущиеДанные.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура НадписьКонтактаНажатие(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ОтправительКонтакт)
		 И ТипЗнч(Объект.ОтправительКонтакт) = Тип("СправочникСсылка.Контрагенты") Тогда
		 
		ОткрытьФормуКонтрагента(Объект.ОтправительКонтакт);
		
	Иначе
		
		УточнитьКонтакт();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенияПриАктивизацииСтроки(Элемент)
	
	текДанные = Элементы.Вложения.ТекущиеДанные;
	Элементы.ОткрытьВложение.Доступность	= НЕ текДанные = Неопределено;
	Элементы.СохранитьВложение.Доступность	= НЕ текДанные = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработаноПриИзменении(Элемент)
	
	Если Объект.Обработано Тогда
		
		ТекПользователь = ОбщегоНазначенияСтоматология.ТекущийПользователь();
		
		Если Объект.Ответственный <> ТекПользователь Тогда
			
			Объект.Ответственный = ТекПользователь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УточнитьКонтакт()
	
	ЗаголовокФормы = "Соответствие адресу <" + Объект.ОтправительАдрес + ">";
	ПараметрыФормы = Новый Структура("Заголовок", ЗаголовокФормы);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораКонтрагента", ЭтаФорма);
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбора",,,,,,Оповещение);  
	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеВыбораКонтрагента(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ОтправительКонтакт = Результат;
	Объект.Предмет			  = Результат;
	
	ЭтаФорма.Записать();
	
	EmailПрисвоен = УправлениеКонтактнойИнформациейСлужебныйВызовСервераСтоматология.ПрисвоитьEmailКонтрагенту(Результат, Объект.ОтправительАдрес);
	
	Если EmailПрисвоен Тогда
		
		ТекстОповещения = "Контактная информация обновлена.";
		НавСсылка = ПолучитьНавигационнуюСсылку(Результат);
		КартинкаОповещения = БиблиотекаКартинок.Информация32;
		ПоказатьОповещениеПользователя(ТекстОповещения, НавСсылка, Результат, КартинкаОповещения);
		
		Элементы.НадписьКонтакта.Заголовок = Строка(Объект.ОтправительКонтакт);
		
	КонецЕсли;
	
КонецПроцедуры	
	
&НаСервере
Процедура ОпределитьОтправителяПисьма()
	
	Если (НЕ ЗначениеЗаполнено(Объект.ОтправительКонтакт)
		ИЛИ ТипЗнч(Объект.ОтправительКонтакт) <> Тип("СправочникСсылка.Контрагенты")) И  ЗначениеЗаполнено(Объект.ОтправительАдрес) Тогда
		
		// Если при создании вх. почты контакт еще не был уточнен,
		// осуществляем поиск контрагента по E-mail.
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|ГДЕ
		|	КонтрагентыКонтактнаяИнформация.АдресЭП = &Email
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка УБЫВ";
		
		Запрос.УстановитьПараметр("Email", Объект.ОтправительАдрес);
		
		УстановитьПривилегированныйРежим(Истина);  	// ******
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);		// ******
		
		Если Выборка.Следующий() Тогда
			Объект.ОтправительКонтакт = Выборка.Ссылка;
			Объект.Предмет			  = Выборка.Ссылка;
			Записать(Новый Структура());
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(Объект.ОтправительКонтакт) = Тип("СправочникСсылка.Контрагенты") Тогда
		Элементы.НадписьКонтакта.Заголовок = Строка(Объект.ОтправительКонтакт);
	Иначе
		Элементы.НадписьКонтакта.Заголовок = "Уточнить контакт";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКонтрагента(Контрагент)
	
	ИмяОткрываемойФормы = ?(КотрагентЯвляетсяКлиентом(Контрагент), "ФормаЭлементаКлиенты", "ФормаЭлемента");
	
	ПараметрыФормы = Новый Структура("Ключ", Контрагент);
	ОткрытьФорму("Справочник.Контрагенты.Форма." + ИмяОткрываемойФормы, ПараметрыФормы);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КотрагентЯвляетсяКлиентом(Контрагент)
	
	Возврат Контрагент.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиенты;
	
КонецФункции

&НаСервере
Функция ПроверитьНаВозможностьОтпавкиПисьма(УчетнаяЗаписьСсылка) 
	
	Если НЕ УчетнаяЗаписьСсылка.ИспользоватьДляОтправки Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура СформироватьОписаниеПисьма()
	
	Начало = "
	|<html>
	|<head>  
	|<META http-equiv=Content-Type content=""text/html; charset=" + СокрЛП(Объект.Кодировка) + """>
	|<META content=""MSHTML 6.00.2800.1400"" name=GENERATOR>
	|<body scroll=""auto"">";
	
	Если ЗначениеЗаполнено(Объект.ТекстHTML) Тогда
		
		Описание = Объект.ТекстHTML;
		
	Иначе
		
		Описание = Объект.Текст;
		
		Если Найти(Описание, Символы.ПС) > 0 Тогда
			Описание = СтрЗаменить(Описание, Символы.ПС, "<br>");
		КонецЕсли;
		
	КонецЕсли;
	
	Конец = "
	|</body>
	|</html>";
	
	Описание = Начало + Описание + Конец;
	
	ТекстПисьма = Описание;
	
	ОтправительПредставление = Объект.ОтправительПредставление;
	Элементы.ОтправительПредставление.Подсказка = Объект.ОтправительАдрес;
	
	ПолучателиКопийПредставление = Объект.СписокПолучателейКопий;
	ПолучателиПредставление = Объект.СписокПолучателейПисьма;
	
	табВложения = УправлениеЭлектроннойПочтой.ПолучитьВложенияЭлектронногоПисьма(Объект.Ссылка);
	
	Вложения.Очистить();
	Для Каждого Стр Из табВложения Цикл
		новСтр = Вложения.Добавить();
		новСтр.Ссылка         = Стр.Ссылка;
		новСтр.ИмяФайла       = Стр.ИмяФайла;
		новСтр.ИндексКартинки = Стр.ИндексКартинки;
		новСтр.Размер         = Стр.Размер;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗадатьВидимостьЭлементов()
	
	// Видимость группы вложений письма
	Если Вложения.Количество() = 0 Тогда
		Элементы.ГруппаВложения.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик создания нового взаимодействия "Встреча"
Процедура ЗапланироватьВстречу(Команда)
	
	СоздатьНовоеВзаимодействие(ПредопределенноеЗначение("Справочник.ВидыВзаимодействий.Встреча"));
		
КонецПроцедуры

&НаКлиенте
// Обработчик создания нового взаимодействия "Телефонный звонок исходящий"
Процедура ЗапланироватьТелефонныйЗвонок(Команда)

   СоздатьНовоеВзаимодействие(ПредопределенноеЗначение("Справочник.ВидыВзаимодействий.ЗвонокИсходящий"));
		
КонецПроцедуры

&НаКлиенте
// Создать новое взаимодействие на основании данного существующего
Процедура СоздатьНовоеВзаимодействие(ВидВзаимодействия)
	
	// Если документ модифицирован необходимо его предварительно записать
	Если Объект.Ссылка.Пустая() ИЛИ Модифицированность Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьНовоеВзаимодействиеЗавершение", ЭтотОбъект, Новый Структура("ВидВзаимодействия", ВидВзаимодействия));
		ПоказатьВопрос(ОписаниеОповещения, "Документ должен быть записан! Записать?", РежимДиалогаВопрос.ДаНет);
        Возврат;
		
	КонецЕсли;
	
	// Открываем форму нового взаимодействия
	СоздатьНовоеВзаимодействиеФрагмент(ВидВзаимодействия);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Создать новое взаимодействие завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура СоздатьНовоеВзаимодействиеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ВидВзаимодействия = ДополнительныеПараметры.ВидВзаимодействия;
	
	Если КодВозвратаДиалога.Да = РезультатВопроса Тогда
		Если НЕ Записать() Тогда
			Возврат;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	СоздатьНовоеВзаимодействиеФрагмент(ВидВзаимодействия);

КонецПроцедуры

&НаКлиенте
// Процедура - Создать новое взаимодействие фрагмент
//
// Параметры:
//  ВидОперацииВзаимодействия	 - 	 - 
//
Процедура СоздатьНовоеВзаимодействиеФрагмент(Знач ВидВзаимодействия)
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ВидВзаимодействияСправочник", ВидВзаимодействия);
	ДанныеЗаполнения.Вставить("ЗадачаТема",              Объект.Тема);
	Если ТипЗнч(Объект.ОтправительКонтакт) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(Объект.ОтправительКонтакт) Тогда
		ДанныеЗаполнения.Вставить("Контрагент", Объект.ОтправительКонтакт);
		ДанныеЗаполнения.Вставить("ЗадачаПредмет", Объект.ОтправительКонтакт);
	КонецЕсли;
	
	ОткрытьФорму("Задача.Взаимодействие.ФормаОбъекта",Новый Структура("Основание", ДанныеЗаполнения));

КонецПроцедуры

&НаКлиенте
// Процедура - Удалить письмо
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура УдалитьПисьмо(Команда)
	
	ТекстВопроса = ?(Объект.ПометкаУдаления,
					"Вы действительно хотите снять пометку удаления у письма?",
					"Вы действительно хотите пометить письмо на удаление?");
	
	ПоказатьВопрос(Новый ОписаниеОповещения("УдалитьПисьмоЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Удалить письмо завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура УдалитьПисьмоЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		Если НЕ Объект.Ссылка.Пустая() Тогда
			УстановитьПометкуУдаления(Объект.Ссылка);
		КонецЕсли;
		
		Оповестить("ИзмененоЭлектронноеПисьмо");
		
		Прочитать(); // Обновляем данные на форме
		
		// Если письмо было удалено - закрываем форму
		Если Объект.ПометкаУдаления Тогда
			Модифицированность = Ложь;
			Закрыть();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПометкуУдаления(ПисьмоСсылка)
	
	ПисьмоОбъект = ПисьмоСсылка.ПолучитьОбъект();
	ПисьмоОбъект.ПометкаУдаления = НЕ ПисьмоОбъект.ПометкаУдаления;
	ПисьмоОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти
